Configuration/Documents/бит_ум_ОтчетностьПоИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ум_ОтчетностьПоИР</Name>
			<BasedOn>
				<xr:Item>Document.ПриемНаРаботу</xr:Item>
				<xr:Item>Document.Увольнение</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ум_ВыполненныеДействия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ум_ВидыСобытийПоИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеВыполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыполняемыеДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>(служебный)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ум_ДействияПоСобытиям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметрыПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>(служебный)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ум_ДополнительныеПараметрыПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ум_ДополнительныеПараметрыПечати</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗначениеПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/InformationRegisters/бит_ум_ДопДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ум_ДопДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимВъезда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ум_РежимыВъездаИР</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ум_СтатусыИР</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУбытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РучнойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланируемаяДатаОкончанияТрудовойДеятельности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/InformationRegisters/бит_ум_ВыполненныеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ум_ВыполненныеДействия</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ДействияПоСобытиям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Enums/бит_ум_ВидыСобытийПоИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ум_ВидыСобытийПоИР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прибытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Убытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Catalogs/бит_ум_ДействияПоСобытиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ум_ДействияПоСобытиям</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтролироватьИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОформляемогоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ВидыОформляемыхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРазбиватьНаСтраницы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьНомерСтраницы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыИР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусИР</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ум_СтатусыИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимВъездаИР</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ум_РежимыВъездаИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>События</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ум_ВидыСобытийПоИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНастройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ум_НастройкиДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ум_НастройкиДействий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/Documents/бит_ум_ОтчетностьПоИР/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов.
//
// Возвращаемое значение:
//   Массив - список имен реквизитов объекта.
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	НеРедактируемыеРеквизиты.Добавить("КраткийСоставДокумента");
	НеРедактируемыеРеквизиты.Добавить("ВсеВыполнено");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Реестр действий
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрДействий";
	КомандаПечати.Представление = НСтр("ru = 'Реестр действий'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МенеджерПечати = "Документ.бит_ум_ОтчетностьПоИР";	
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрДокументов";
	КомандаПечати.Представление = НСтр("ru = 'Реестр документов'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МенеджерПечати = "Документ.бит_ум_ОтчетностьПоИР";	
	
	// Печать всех документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьФормОтчетности";
	КомандаПечати.Представление = НСтр("ru = 'Печать всех документов'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МенеджерПечати = "Документ.бит_ум_ОтчетностьПоИР";	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрДействий") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрДействий", НСтр("ru = 'Реестр действий'"), 
			ПечатьРеестраДействий(МассивОбъектов, ОбъектыПечати), , "Документ.бит_ум_ОтчетностьПоИР.ПФ_MXL_РеестрДействий");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрДокументов") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрДокументов", НСтр("ru = 'Реестр документов'"), 
			ПечатьРеестраДокументов(МассивОбъектов, ОбъектыПечати), , "Документ.бит_ум_ОтчетностьПоИР.ПФ_MXL_РеестрДокументов");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьФормОтчетности") Тогда
		бит_ум_УчетМигрантовСервер.ПечатьФормОтчетности(МассивОбъектов, ПараметрыПечати,
			КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается при переходе на версию конфигурации 3.1.11.3.
//
Процедура ОбновлениеДокументов_3_1_11_3() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетностьПоИР.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_ум_ОтчетностьПоИР КАК ОтчетностьПоИР
	|ГДЕ
	|	(ОтчетностьПоИР.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ОтчетностьПоИР.Действия = """")";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ДатаСобытия = ДокументОбъект.Дата; 
		ДокументОбъект.Действия = СтрСоединить(ОбщегоНазначенияКлиентСервер.СвернутьМассив(
			ДокументОбъект.ВыполняемыеДействия.ВыгрузитьКолонку("Действие")), ", ");
			
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, , , РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьРеестраДействий(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ум_ОтчетностьПоИР_РеестрДействий";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.бит_ум_ОтчетностьПоИР.ПФ_MXL_РеестрДействий");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетностьПоИРВыполняемыеДействия.Ссылка КАК Ссылка,
	|	ОтчетностьПоИРВыполняемыеДействия.Действие.КонтролирующийОрган КАК ВидДокументаКонтролирующийОрган,
	|	ОтчетностьПоИРВыполняемыеДействия.Сотрудник,
	|	ОтчетностьПоИРВыполняемыеДействия.Действие
	|ИЗ
	|	Документ.бит_ум_ОтчетностьПоИР.ВыполняемыеДействия КАК ОтчетностьПоИРВыполняемыеДействия
	|ГДЕ
	|	ОтчетностьПоИРВыполняемыеДействия.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ВидДокументаКонтролирующийОрган,
	|	ОтчетностьПоИРВыполняемыеДействия.Сотрудник.Наименование,
	|	ОтчетностьПоИРВыполняемыеДействия.Действие.Наименование
	|ИТОГИ ПО
	|	Ссылка,
	|	ВидДокументаКонтролирующийОрган";
	
	Результат = Запрос.Выполнить();
	Шапка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока Шапка.Следующий() Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
		
		ВыборкаВидДокументаКонтролирующийОрган = Шапка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаВидДокументаКонтролирующийОрган.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("ВидДокументаКонтролирующийОрган");
			ОбластьМакета.Параметры.Заполнить(ВыборкаВидДокументаКонтролирующийОрган);
			ТабличныйДокумент.Вывести(ОбластьМакета, ВыборкаВидДокументаКонтролирующийОрган.Уровень() - 1);
		
			ВыборкаДетали = ВыборкаВидДокументаКонтролирующийОрган.Выбрать();
		
			Пока ВыборкаДетали.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("Детали");
				ОбластьМакета.Параметры.Заполнить(ВыборкаДетали);
				ТабличныйДокумент.Вывести(ОбластьМакета, ВыборкаДетали.Уровень() - 1);
			КонецЦикла;
		КонецЦикла;
		
		ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьРеестраДокументов(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ум_ОтчетностьПоИР_РеестрДокументов";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.бит_ум_ОтчетностьПоИР.ПФ_MXL_РеестрДокументов");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетностьПоИРВыполняемыеДействия.Ссылка КАК Ссылка,
	|	ОтчетностьПоИРВыполняемыеДействия.Действие.КонтролирующийОрган КАК ВидДокументаКонтролирующийОрган,
	|	ОтчетностьПоИРВыполняемыеДействия.Сотрудник,
	|	ОтчетностьПоИРВыполняемыеДействия.Действие.ВидОформляемогоДокумента КАК ВидОформляемогоДокумента
	|ИЗ
	|	Документ.бит_ум_ОтчетностьПоИР.ВыполняемыеДействия КАК ОтчетностьПоИРВыполняемыеДействия
	|ГДЕ
	|	ОтчетностьПоИРВыполняемыеДействия.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ВидДокументаКонтролирующийОрган,
	|	ОтчетностьПоИРВыполняемыеДействия.Сотрудник.Наименование,
	|	ОтчетностьПоИРВыполняемыеДействия.Действие.ВидОформляемогоДокумента.Наименование
	|ИТОГИ ПО
	|	Ссылка,
	|	ВидДокументаКонтролирующийОрган";
	
	Результат = Запрос.Выполнить();
	Шапка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока Шапка.Следующий() Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
		
		ВыборкаВидДокументаКонтролирующийОрган = Шапка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаВидДокументаКонтролирующийОрган.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("ВидДокументаКонтролирующийОрган");
			ОбластьМакета.Параметры.Заполнить(ВыборкаВидДокументаКонтролирующийОрган);
			ТабличныйДокумент.Вывести(ОбластьМакета, ВыборкаВидДокументаКонтролирующийОрган.Уровень() - 1);
		
			ВыборкаДетали = ВыборкаВидДокументаКонтролирующийОрган.Выбрать();
		
			Пока ВыборкаДетали.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("Детали");
				ОбластьМакета.Параметры.Заполнить(ВыборкаДетали);
				ТабличныйДокумент.Вывести(ОбластьМакета, ВыборкаДетали.Уровень() - 1);
			КонецЦикла;
		КонецЦикла;
		
		ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
	
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Процедура заполнения табличной части.
//
Процедура ПодготовитьДанныеДляЗаполнения(Параметры, АдресРезультата) Экспорт
	
	ДанныеДляЗаполнения = Новый Структура;
	
	ТаблицаВыполняемыеДействия = Параметры.ТаблицаВыполняемыеДействия;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("Период", Параметры.Дата);
	Запрос.УстановитьПараметр("Событие", Параметры.Событие);	
	Если Параметры.Свойство("Основание") Тогда
		Запрос.УстановитьПараметр("Основание", Параметры.Основание);
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Сотрудник") И НЕ Параметры.Свойство("Основание") И
		(Параметры.Событие = Перечисления.бит_ум_ВидыСобытийПоИР.ПриемНаРаботу
		ИЛИ Параметры.Событие = Перечисления.бит_ум_ВидыСобытийПоИР.Увольнение) Тогда    
		
		Запрос.Текст = 
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ДопДанныеФизЛицСрезПоследних.Физлицо КАК ФизическоеЛицо,
        |	ДопДанныеФизЛицСрезПоследних.РежимВъезда КАК РежимВъезда,
        |	ДопДанныеФизЛицСрезПоследних.Статус КАК Статус,
        |	ДопДанныеФизЛицСрезПоследних.ДатаПрибытия КАК ДатаПрибытия,
        |	ДопДанныеФизЛицСрезПоследних.ДатаУбытия КАК ДатаУбытия
        |ПОМЕСТИТЬ ВТФизическиеЛица
        |ИЗ
        |	РегистрСведений.бит_ум_ДопДанныеФизЛиц.СрезПоследних(&Период, ) КАК ДопДанныеФизЛицСрезПоследних
        |ГДЕ
        |	ДопДанныеФизЛицСрезПоследних.РучнойУчет = ЛОЖЬ
        |
        |ИНДЕКСИРОВАТЬ ПО
        |	ФизическоеЛицо";  
		
		Запрос.Выполнить();
		
		ПараметрыПолученияСотрудников =
			КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
			
		ПараметрыПолученияСотрудников.ИмяВТФизическиеЛица = "ВТФизическиеЛица";	
		ПараметрыПолученияСотрудников.КадровыеДанные = "ДатаПриема,ДатаУвольнения"; 
		ПараметрыПолученияСотрудников.Организация = Параметры.Организация;  
		
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(
			МенеджерВременныхТаблиц, Истина, 
			ПараметрыПолученияСотрудников,
			"ВТСотрудникиФизическихЛиц");   
			
	КонецЕсли;              
		
	// Получение перечня требуемых документов
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыДействийПоСобытиямВидыИР.СтатусИР КАК СтатусИР,
	|	ВидыДействийПоСобытиямВидыИР.РежимВъездаИР КАК РежимВъездаИР,
	|	ВидыДействийПоСобытиямВидыИР.Ссылка КАК ВыполняемоеДействие
	|ПОМЕСТИТЬ ПереченьДействий
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям.ВидыИР КАК ВидыДействийПоСобытиямВидыИР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ум_ДействияПоСобытиям.События КАК ВидыДействийПоСобытиямСобытия
	|		ПО ВидыДействийПоСобытиямВидыИР.Ссылка = ВидыДействийПоСобытиямСобытия.Ссылка
	|ГДЕ
	|	ВидыДействийПоСобытиямСобытия.Событие = &Событие
	|	И ВидыДействийПоСобытиямСобытия.Ссылка.ВАрхиве = ЛОЖЬ";			
	
	Если Параметры.Свойство("Сотрудник") Тогда   
		
		Запрос.УстановитьПараметр("Сотрудник", Параметры.Сотрудник); 
		
		Запрос.Текст = Запрос.Текст + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	ДопДанныеФизЛиц.РежимВъезда КАК РежимВъезда,
		|	ДопДанныеФизЛиц.Статус КАК Статус
		|ПОМЕСТИТЬ ПереченьСотрудников
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ум_ДопДанныеФизЛиц.СрезПоследних(
		|				&Период,
		|				(ДатаУбытия = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ ДатаУбытия > &Период)
		|					И НЕ РучнойУчет) КАК ДопДанныеФизЛиц
		|		ПО Сотрудники.ФизическоеЛицо = ДопДанныеФизЛиц.Физлицо
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";
		
	ИначеЕсли Параметры.Событие = Перечисления.бит_ум_ВидыСобытийПоИР.Прибытие Тогда
		
		Запрос.Текст = Запрос.Текст + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	ДопДанныеФизЛиц.РежимВъезда КАК РежимВъезда,
		|	ДопДанныеФизЛиц.Статус КАК Статус
		|ПОМЕСТИТЬ ПереченьСотрудников
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ум_ДопДанныеФизЛиц.СрезПоследних(
		|				&Период,
		|				ДатаПрибытия > ДАТАВРЕМЯ(1, 1, 1)
		|					И ДатаПрибытия <= &Период
		|					И НЕ РучнойУчет) КАК ДопДанныеФизЛиц
		|		ПО Сотрудники.ФизическоеЛицо = ДопДанныеФизЛиц.Физлицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ПО Сотрудники.Ссылка = ТекущиеКадровыеДанныеСотрудников.Сотрудник
		|ГДЕ
		|	Сотрудники.ГоловнаяОрганизация = &Организация
		|	И (ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения > &Период)";
									   
	ИначеЕсли Параметры.Событие = Перечисления.бит_ум_ВидыСобытийПоИР.ПриемНаРаботу Тогда
		
		Если Параметры.Свойство("Основание") Тогда
			
			Запрос.Текст = Запрос.Текст + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПриемНаРаботу.Сотрудник,
			|	ДопДанныеФизЛиц.РежимВъезда КАК РежимВъезда,
			|	ДопДанныеФизЛиц.Статус КАК Статус
			|ПОМЕСТИТЬ ПереченьСотрудников
			|ИЗ
			|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ум_ДопДанныеФизЛиц.СрезПоследних(
			|				&Период,
			|				(ДатаУбытия = ДАТАВРЕМЯ(1, 1, 1)
			|					ИЛИ ДатаУбытия > &Период)
			|					И НЕ РучнойУчет) КАК ДопДанныеФизЛиц
			|		ПО ПриемНаРаботу.ФизическоеЛицо = ДопДанныеФизЛиц.Физлицо
			|ГДЕ
			|	ПриемНаРаботу.Ссылка = &Основание
			|	И ПриемНаРаботу.Организация = &Организация";
			
		Иначе   
			
			Запрос.Текст = Запрос.Текст + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СотрудникиФизическихЛиц.Сотрудник КАК Сотрудник,
			|	ДопДанныеФизЛиц.РежимВъезда КАК РежимВъезда,
			|	ДопДанныеФизЛиц.Статус КАК Статус
			|ПОМЕСТИТЬ ПереченьСотрудников
			|ИЗ
			|	ВТСотрудникиФизическихЛиц КАК СотрудникиФизическихЛиц
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизическиеЛица КАК ДопДанныеФизЛиц
			|		ПО СотрудникиФизическихЛиц.ФизическоеЛицо = ДопДанныеФизЛиц.ФизическоеЛицо
			|ГДЕ
			|	СотрудникиФизическихЛиц.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
			|	И (ДопДанныеФизЛиц.ДатаУбытия = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ ДопДанныеФизЛиц.ДатаУбытия > &Период)";
			
		КонецЕсли;
		
	ИначеЕсли Параметры.Событие = Перечисления.бит_ум_ВидыСобытийПоИР.Увольнение Тогда
		
		Если Параметры.Свойство("Основание") Тогда
			
			Запрос.Текст = Запрос.Текст + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Увольнение.Сотрудник,
			|	ДопДанныеФизЛиц.РежимВъезда КАК РежимВъезда,
			|	ДопДанныеФизЛиц.Статус КАК Статус
			|ПОМЕСТИТЬ ПереченьСотрудников
			|ИЗ
			|	Документ.Увольнение КАК Увольнение
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ум_ДопДанныеФизЛиц.СрезПоследних(
			|				&Период,
			|				НЕ РучнойУчет) КАК ДопДанныеФизЛиц
			|		ПО Увольнение.ФизическоеЛицо = ДопДанныеФизЛиц.Физлицо
			|ГДЕ
			|	Увольнение.Ссылка = &Основание
			|	И Увольнение.Организация = &Организация";			
			
		Иначе                   
			
			Запрос.Текст = Запрос.Текст + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СотрудникиФизическихЛиц.Сотрудник КАК Сотрудник,
			|	ДопДанныеФизЛиц.РежимВъезда КАК РежимВъезда,
			|	ДопДанныеФизЛиц.Статус КАК Статус
			|ПОМЕСТИТЬ ПереченьСотрудников
			|ИЗ
			|	ВТСотрудникиФизическихЛиц КАК СотрудникиФизическихЛиц
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизическиеЛица КАК ДопДанныеФизЛиц
			|		ПО СотрудникиФизическихЛиц.ФизическоеЛицо = ДопДанныеФизЛиц.ФизическоеЛицо
			|ГДЕ
			|	СотрудникиФизическихЛиц.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)";
			
		КонецЕсли;
		
	ИначеЕсли Параметры.Событие = Перечисления.бит_ум_ВидыСобытийПоИР.Убытие Тогда
		
		Запрос.Текст = Запрос.Текст + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	ДопДанныеФизЛиц.РежимВъезда КАК РежимВъезда,
		|	ДопДанныеФизЛиц.Статус КАК Статус
		|ПОМЕСТИТЬ ПереченьСотрудников
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ум_ДопДанныеФизЛиц.СрезПоследних(
		|				&Период,
		|				ДатаПрибытия <= &Период
		|					И ДатаУбытия <> ДАТАВРЕМЯ(1, 1, 1)
		|					И НЕ РучнойУчет) КАК ДопДанныеФизЛиц
		|		ПО Сотрудники.ФизическоеЛицо = ДопДанныеФизЛиц.Физлицо
		|ГДЕ
		|	Сотрудники.ГоловнаяОрганизация = &Организация";
		
	Иначе // Прочее
		
		Запрос.Текст = Запрос.Текст + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	ДопДанныеФизЛиц.РежимВъезда КАК РежимВъезда,
		|	ДопДанныеФизЛиц.Статус КАК Статус
		|ПОМЕСТИТЬ ПереченьСотрудников
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ум_ДопДанныеФизЛиц.СрезПоследних(&Период, НЕ РучнойУчет) КАК ДопДанныеФизЛиц
		|		ПО Сотрудники.ФизическоеЛицо = ДопДанныеФизЛиц.Физлицо
		|ГДЕ
		|	Сотрудники.ГоловнаяОрганизация = &Организация";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
	"ВЫБРАТЬ
	|	ВыполненныеДействия.Действие КАК Действие,
	|	ВыполненныеДействия.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВыполненныеДействия
	|ИЗ
	|	РегистрСведений.бит_ум_ВыполненныеДействия.СрезПоследних(
	|			&Период,
	|			Действие В
	|					(ВЫБРАТЬ
	|						ПереченьДействий.ВыполняемоеДействие
	|					ИЗ
	|						ПереченьДействий)
	|				И Организация = &Организация
	|				И Сотрудник В
	|					(ВЫБРАТЬ
	|						ПереченьСотрудников.Сотрудник
	|					ИЗ
	|						ПереченьСотрудников)) КАК ВыполненныеДействия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Действие,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТребуетсяОформить.Сотрудник КАК Сотрудник,
	|	ТребуетсяОформить.ВыполняемоеДействие КАК Действие
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПереченьСотрудников.Сотрудник КАК Сотрудник,
	|		ПереченьДействий.ВыполняемоеДействие КАК ВыполняемоеДействие
	|	ИЗ
	|		ПереченьСотрудников КАК ПереченьСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПереченьДействий КАК ПереченьДействий
	|			ПО (ПереченьДействий.СтатусИР = ПереченьСотрудников.Статус
	|						И ПереченьДействий.РежимВъездаИР = ПереченьСотрудников.РежимВъезда
	|					ИЛИ ПереченьДействий.СтатусИР = ПереченьСотрудников.Статус
	|						И ПереченьДействий.РежимВъездаИР = ЗНАЧЕНИЕ(Перечисление.бит_ум_РежимыВъездаИР.ПустаяСсылка)
	|					ИЛИ ПереченьДействий.СтатусИР = ЗНАЧЕНИЕ(Перечисление.бит_ум_СтатусыИР.ПустаяСсылка)
	|						И ПереченьДействий.РежимВъездаИР = ПереченьСотрудников.РежимВъезда
	|					ИЛИ ПереченьДействий.СтатусИР = ЗНАЧЕНИЕ(Перечисление.бит_ум_СтатусыИР.ПустаяСсылка)
	|						И ПереченьДействий.РежимВъездаИР = ЗНАЧЕНИЕ(Перечисление.бит_ум_РежимыВъездаИР.ПустаяСсылка))) КАК ТребуетсяОформить
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыполненныеДействия КАК ВыполненныеДействия
	|		ПО ТребуетсяОформить.ВыполняемоеДействие = ВыполненныеДействия.Действие
	|			И ТребуетсяОформить.Сотрудник = ВыполненныеДействия.Сотрудник
	|ГДЕ
	|	ВыполненныеДействия.Действие ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ВыполняемоеДействие";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаВыполняемыеДействия.Добавить(), Выборка);
	КонецЦикла;
	
	ДанныеДляЗаполнения.Вставить("ТаблицаВыполняемыеДействия", ТаблицаВыполняемыеДействия);
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресРезультата);
	
КонецПроцедуры

Функция ОпределитьСобытиеПоСотруднику(Сотрудник) Экспорт
	
	ФизическиеЛица = КадровыйУчет.ФизическиеЛицаСотрудников(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник));
		
	Если ФизическиеЛица.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическиеЛица[0]);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.бит_ум_ВидыСобытийПоИР.Прибытие) КАК Событие,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТПриоритетСобытий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.бит_ум_ВидыСобытийПоИР.ПриемНаРаботу),
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.бит_ум_ВидыСобытийПоИР.Увольнение),
	|	3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.бит_ум_ВидыСобытийПоИР.Убытие),
	|	4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыДействийПоСобытиямВидыИР.СтатусИР КАК СтатусИР,
	|	ВидыДействийПоСобытиямВидыИР.РежимВъездаИР КАК РежимВъездаИР,
	|	ВидыДействийПоСобытиямВидыИР.Ссылка КАК ВыполняемоеДействие,
	|	ВидыДействийПоСобытиямСобытия.Событие КАК Событие
	|ПОМЕСТИТЬ ВТПереченьДействий
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям.ВидыИР КАК ВидыДействийПоСобытиямВидыИР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ум_ДействияПоСобытиям.События КАК ВидыДействийПоСобытиямСобытия
	|		ПО ВидыДействийПоСобытиямВидыИР.Ссылка = ВидыДействийПоСобытиямСобытия.Ссылка
	|ГДЕ
	|	ВидыДействийПоСобытиямСобытия.Ссылка.ВАрхиве = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатусИР,
	|	РежимВъездаИР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДопДанныеФизЛицСрез.РежимВъезда КАК РежимВъезда,
	|	ДопДанныеФизЛицСрез.Статус КАК Статус
	|ПОМЕСТИТЬ ВТСтатусРаботника
	|ИЗ
	|	РегистрСведений.бит_ум_ДопДанныеФизЛиц.СрезПоследних(&Период, Физлицо = &ФизическоеЛицо) КАК ДопДанныеФизЛицСрез
	|ГДЕ
	|	НЕ ДопДанныеФизЛицСрез.РучнойУчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПереченьДействий.Событие КАК Событие
	|ПОМЕСТИТЬ ВТОжидаемыеСобытия
	|ИЗ
	|	ВТПереченьДействий КАК ПереченьДействий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатусРаботника КАК СтатусРаботника
	|		ПО ПереченьДействий.СтатусИР = СтатусРаботника.Статус
	|			И ПереченьДействий.РежимВъездаИР = СтатусРаботника.РежимВъезда
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ум_ВыполненныеДействия.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК ВыполненныеДействия
	|		ПО ПереченьДействий.ВыполняемоеДействие = ВыполненныеДействия.Действие
	|ГДЕ
	|	ВыполненныеДействия.Сотрудник ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриоритетСобытий.Событие КАК Событие,
	|	ПриоритетСобытий.Приоритет КАК Приоритет
	|ИЗ
	|	ВТПриоритетСобытий КАК ПриоритетСобытий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОжидаемыеСобытия КАК ОжидаемыеСобытия
	|		ПО (ОжидаемыеСобытия.Событие = ПриоритетСобытий.Событие)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Событие;             
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
